package part2;

public class Test_2 {
   
    public static void main(String args){

        // 1. FizzBuzz問題
        // 1から100までの数字を利用して

        // 3の倍数の時はFizz
        // 5の倍数の時はBuzz
        // 15の倍数はFizzBuzz
        // それ以外は数字を出力する

        // このような出力をするコードを書いてください
            // hint : for文を使います(i++), while文でも可
            // hint : if文を使います 






        // 2. 九九の表を出力してください

        // 出力は以下のようになります
        // 1 2 3 4 5 6 7 8 9
        // 2 4 6 8 10 12 14 16 18
        // 3 6 9 12 15 18 21 24 27
        // 4 8 12 16 20 24 28 32 36
        // 5 10 15 20 25 30 35 40 45
        // 6 12 18 24 30 36 42 48 54
        // 7 14 21 28 35 42 49 56 63
        // 8 16 24 32 40 48 56 64 72
        // 9 18 27 36 45 54 63 72 81

            // hint : for文を使います(i++), while文でも可
            // hint : 多次元配列
            // hint : for文を2回使いましょう









    }
}
